# AutoJoin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions..::..AutoJoin Property
IFCImportOptions Class See Also
---
Enable or disable auto-join at the end of import.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool AutoJoin { get; set; }
```

Visual Basic
---
```text
Public Property AutoJoin As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool AutoJoin {
	bool get ();
	void set (bool value);
}
```

# Remarks
Enabling auto-join will join appropriate elements (e.g., walls, columns), but will take extra time and may fail. Disabling auto-join will allow some imports that otherwise fail. Default is true for Open IFC; it is ignored (and false) for Link IFC.
# See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace